---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AnalyticalOpening
source: html/71834978-3582-2645-c70b-ae6121d8b118.htm
---
# AnalyticalOpening Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.